old_tries/fully_working_instructions_inside/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    allBoundary
    {
        type            patch;
        nFaces          1200;
        startFace       91025;
    }
    allboundary2
    {
        type            patch;
        nFaces          1275;
        startFace       92225;
    }
    art
    {
        type            wall;
        inGroups        1(wall);
        nFaces          7455;
        startFace       93500;
    }
    inlet
    {
        type            wall;
        inGroups        1(wall);
        nFaces          179;
        startFace       100955;
    }
)

// ************************************************************************* //
